#### DataFrame = 2차원 데이터(Series 들의 모음)

### dict 자료구조 통해 생성
data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}

### DataFrame 객체 생성
import pandas as pd
df=pd.DataFrame(data)

### 데이터 접근
# print(df['이름'])
# print(df['키'])

# (데이터를 2개 이상 가져올때는 대괄호를 하나 더 써야함)
print(df[['이름','키']])

### DataFrame 객체 생성(Index 지정)
df=pd.DataFrame(data, index=['1번','2번','3번','4번','5번','6번','7번','8번'])
print(df)

### DataFrame 객체 생성(Column 지정)
# data 중에서 원하는 column만 선택하거나, 순서 변경 가능
df=pd.DataFrame(data, columns=['이름','학교','키'])
print(df)